export const titles = {
    ai: 'ИИ голосовых переводов вышел на новый уровень теперь машина может не только переводить голос и видео, но и адаптировать их с учётом тембра, акцента, интонаций, эмоций и, конечно же... с автосинхроном движения губ и лица.',
    mot: 'Чаще всего, я рассказываю свои планы только тем людям, которые реально смогут мне помочь и направить в этой сфере, поделиться советом.Второе. Когда я все же осмеливаюсь рассказать об этом друзьям - все мои близкие друзья знают, что я не люблю "пустую" похвалу, и я говорю им прям это четко перед тем, как озвучить свои мысли.',
    adv:'Представьте, заходите в Телеграм почитать новости, переходите в канал, там — бац! — сегодня ваш дом оказывается снесли...'
}